src/cf/InformationRegisters/GDS_ДанныеДляЧтенияИнформацииИзАвтографа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ДанныеДляЧтенияИнформацииИзАвтографа</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ID_схема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеИзАвтограф</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГосНомерИзАвтограф</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Делитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID_Автограф</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/GDS_ФункцииВзаимодействияСАвтограф/Ext/Module.bsl
Процедура ПолучениеИнформацииОТранспортныхСредствахИзАвтограф() Экспорт
	
	ДанныеОМашинах = GDS_ФункцииВзаимодействияСАвтограф.ПолучитьДанныеПоМашинам();
	
	Запрос = Новый Запрос ("ВЫБРАТЬ
	                       |	уатТС.Ссылка
	                       |ИЗ
	                       |	Справочник.уатТС КАК уатТС
	                       |ГДЕ
	                       |	уатТС.ГосударственныйНомер ПОДОБНО &ГосударственныйНомер
	                       |	И НЕ уатТС.ПометкаУдаления");
	
	НабЗаписей = РегистрыСведений.GDS_ДанныеДляЧтенияИнформацииИзАвтографа.СоздатьНаборЗаписей();
	НабЗаписей.Записать();
	
	Для Каждого Машина из ДанныеОМашинах Цикл
		ГосНомер = СокрЛП(Машина.ГосНомер);
								
		Если НЕ ЗначениеЗаполнено(ГосНомер) Тогда
			Продолжить;
		КонецЕсли;
		
		ТС = ПоискМашиныПоГосНомеру(ГосНомер,Запрос);					
					
		Если НЕ ЗначениеЗаполнено(ТС) Тогда
			Продолжить;
		КонецЕсли;
		
		НабЗаписей.Отбор.ТС.Установить(ТС);
		НабЗаписей.Прочитать();
		
		Попытка
			Если ЗначениеЗаполнено(НабЗаписей[0].ТС) Тогда
				Продолжить;
			КонецЕсли;
		Исключение
			
		КонецПопытки;
		
		НЗ = НабЗаписей.Добавить();
		НЗ.Период				 = Дата("20240101");
		НЗ.ТС              		 = ТС;
		НЗ.НаименованиеИзАвтограф= Машина.Группа;
		НЗ.ID_Автограф    		 = Машина.ID;
		НЗ.ID_Схема       	 	 = Машина.СхемаID;
		НЗ.СерийныйНомер   		 = Число(Машина.СерНомер);
		НЗ.ГосНомерИзАвтограф 	 = Машина.ГосНомер;
		
		НабЗаписей.Записать();
	КонецЦикла;
		
КонецПроцедуры

Процедура ПолучитьДанныеИзПОАвтограф(ДатаЗапроса = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаЗапроса) Тогда
		ДатаЗапроса = НачалоДня(НачалоДня(ТекущаяДата())-864000);
	Иначе
		ДатаЗапроса = НачалоДня(ДатаЗапроса);
	КонецЕсли;	
	
	ЗапросДокумента = Новый Запрос("ВЫБРАТЬ
	                      |	GDS_ДанныеИзАвтограф.Ссылка
	                      |ИЗ
	                      |	Документ.GDS_ДанныеИзАвтограф КАК GDS_ДанныеИзАвтограф
	                      |ГДЕ
	                      |	GDS_ДанныеИзАвтограф.Дата = &ДатаЗапроса
	                      |	И НЕ GDS_ДанныеИзАвтограф.ПометкаУдаления
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	GDS_ДанныеИзАвтограф.Ссылка");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	GDS_ДанныеДляЧтенияИнформацииИзАвтографаСрезПоследних.ТС,
	                      |	GDS_ДанныеДляЧтенияИнформацииИзАвтографаСрезПоследних.СерийныйНомер,
	                      |	GDS_ДанныеДляЧтенияИнформацииИзАвтографаСрезПоследних.ID_Автограф,
	                      |	GDS_ДанныеДляЧтенияИнформацииИзАвтографаСрезПоследних.ID_схема,
	                      |	GDS_ДанныеДляЧтенияИнформацииИзАвтографаСрезПоследних.Делитель Как РасчетныйБак
	                      |ИЗ
	                      |	РегистрСведений.GDS_ДанныеДляЧтенияИнформацииИзАвтографа.СрезПоследних(&ДатаЗапроса, ) КАК GDS_ДанныеДляЧтенияИнформацииИзАвтографаСрезПоследних");
	
	ДокументОбъект = ВернутьДокументДляЗаполнения(ЗапросДокумента,НачалоДня(ДатаЗапроса));
				
	Запрос.УстановитьПараметр("ДатаЗапроса",ДатаЗапроса);
	
	ВыборкаТС = Запрос.Выполнить().Выбрать();
	
	ТЗ_ИзАвтографа = Запрос.Выполнить().Выгрузить(); 
	
	ДокументОбъект.Рейсы.Очистить();
	ДокументОбъект.Сливы.Очистить();
	ДокументОбъект.Заправки.Очистить();
	
	Токен = "";
	ИдентификаторСхемы = "";
	АдресСервера = "http://glonass.mecamineft.com";
	ИмяФайлаОтвета = КаталогВременныхФайлов() + "Response.json";
	ПолучитьТокенНаСервере(Токен,ИдентификаторСхемы,АдресСервера,ИмяФайлаОтвета);
	Делитель = -1;
	
	Если НЕ ЗначениеЗаполнено(Токен) Тогда
		Сообщить("Нет данных о токене для авторизации на сайте!");
		
		Возврат;
	КонецЕсли;
	
	МассивСписковТС = Новый Массив;
	СписокТС = "";
	Сч = 1;
	
	Пока ВыборкаТС.Следующий() Цикл
		СписокТС = ?(СписокТС = "", ВыборкаТС.ID_Автограф, СписокТС + "," + ВыборкаТС.ID_Автограф);
		Сч = Сч + 1;
		
		Если Сч = 41 Тогда
			МассивСписковТС.Добавить(СписокТС); 
			СписокТС = "";
			Сч = 1;
		КонецЕсли; 
		
		ID_схема = ВыборкаТС.ID_схема;
	КонецЦикла;	
	
	ДатаНачалаСтрокой = ПреобразоватьДатуВСтроку(НачалоДня(ДокументОбъект.Дата));
	ДатаОкончанияСтрокой = ПреобразоватьДатуВСтроку(КонецДня(ДокументОбъект.Дата));
	
	Если СписокТС <> "" Тогда
		МассивСписковТС.Добавить(СписокТС);
	КонецЕсли;
	
	Для Каждого СписокТС ИЗ МассивСписковТС Цикл
		Попыток = 0;
		~ПробуемЕщеРаз:
		КомандаWindows = "Timeout /T " + Формат(1, "ЧГ=0") + " /NoBreak";
		ЗапуститьПриложение(КомандаWindows,,Истина);
		
		СтрокаЗапроса = "/ServiceJSON/GetTrips?schemaID=" + ID_схема + 
						"&IDs=" + СписокТС + 
						"&SD=" + ДатаНачалаСтрокой + 
						"&ED=" + ДатаОкончанияСтрокой + 
						"&tripSplitterIndex=" + Делитель;
			
		Заголовки = Новый Соответствие;
	   	Заголовки.Вставить("Content-Type", "application/json");
		Заголовки.Вставить("AG-TOKEN", Токен);
		
		СтруктураДанныхПоРейсам = ОтправитьЗапросСервер(СтрокаЗапроса, Заголовки, Ложь, Истина,АдресСервера,ИмяФайлаОтвета);
		
		Если СтруктураДанныхПоРейсам = Неопределено Тогда
			Если Попыток < 10 Тогда
				Попыток = Попыток + 1;
				Перейти ~ПробуемЕщеРаз;       
			КонецЕсли;
			//Сообщить("Проблема! Нет данных из Автографа по машине " + ВыборкаТС.ТС);
			//Большая проблема. Опять что то не так.
			ДокументОбъект.Рейсы.Очистить();
			ДокументОбъект.Сливы.Очистить();
			ДокументОбъект.Заправки.Очистить();   
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
			Возврат;
		КонецЕсли;
		
		СчРейсов = 1;
		
		Для каждого СтрИД Из СтруктураДанныхПоРейсам Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("СерийныйНомер",СтрИД.Значение["Serial"]);
			НайденныеСтроки = ТЗ_ИзАвтографа.НайтиСтроки(Отбор);
			ТС_тек = НайденныеСтроки[0].ТС;
			
			Для каждого Рейс ИЗ СтрИД.Значение["Trips"] Цикл
				НС 		= ДокументОбъект.Рейсы.Добавить(); 
				Заправки= ДокументОбъект.Заправки.Добавить();	
				Сливы 	= ДокументОбъект.Сливы.Добавить();	
				
				НС.СерНомер = СтрИД.Значение["Serial"];
				НС.ТС		= ТС_тек;
				Сливы.ТС	= ТС_тек;
				Заправки.ТС	= ТС_тек;
				
				СчРейсов = СчРейсов + 1;
				
				Для каждого Мест из СтрИД.Значение["Total"] Цикл
					Если Мест.Ключ = "CurrLocation" Тогда
						НС.ГеоЗона = Мест.Value;
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого Ср ИЗ Рейс["Total"] Цикл					
					ИмяКолонки = СтрЗаменить(Ср.Ключ, " ", "_");
					
					Если Ср.Ключ = "DateTime First" Тогда
						ДатаСтр = СтрЗаменить(Ср.Value,":","");
						ДатаСтр = СтрЗаменить(ДатаСтр,"-","");
						ДатаСтр = СтрЗаменить(ДатаСтр,"T","");
						
						Попытка
							НС.НачРейса = Дата(ДатаСтр);
							Сливы.Начало = Дата(ДатаСтр);
							Заправки.Начало = Дата(ДатаСтр);
						Исключение
							Сообщить("Не верно указана дата: " + ДатаСтр);
						КонецПопытки;	
					ИначеЕсли Ср.Ключ = "DateTime Last" Тогда
						ДатаСтр = СтрЗаменить(Ср.Value,":","");
						ДатаСтр = СтрЗаменить(ДатаСтр,"-","");
						ДатаСтр = СтрЗаменить(ДатаСтр,"T","");
						
						Попытка
							НС.КонРейса = Дата(ДатаСтр);
							Сливы.Окончание = Дата(ДатаСтр);
							Заправки.Окончание = Дата(ДатаСтр);
						Исключение
							Сообщить("Не верно указана дата: " + ДатаСтр);
						КонецПопытки;
					ИначеЕсли Ср.Ключ = "TotalDuration" Тогда					
						НС.ВремяРейса = Дата("00010101"+СтрЗаменить(Ср.Value,":",""));	
					ИначеЕсли Ср.Ключ = "MoveDuration" Тогда					
						НС.ВремяДвижения = Дата("00010101"+СтрЗаменить(Ср.Value,":",""));	
					ИначеЕсли Ср.Ключ = "ParkDuration" Тогда					
						НС.ВремяНаОстановках = Дата("00010101"+СтрЗаменить(Ср.Value,":",""));	
					ИначеЕсли Ср.Ключ = "TotalDistance" Тогда
						НС.Пробег = Формат(Ср.Value,"ЧДЦ=2");	
					ИначеЕсли Ср.Ключ = "ParkCount" Тогда
						НС.КолВоОстановок = Ср.Value;	
					ИначеЕсли Ср.Ключ = "MaxSpeed" Тогда
						НС.СкорМакс = Ср.Value;	
					ИначеЕсли Ср.Ключ = "AverageSpeed" Тогда
						НС.СредняяСкорость = Ср.Value;	
					ИначеЕсли Ср.Ключ = "FirstLocation" Тогда
						НС.МестоположениеНач = Ср.Value;	
					ИначеЕсли Ср.Ключ = "LastLocation" Тогда
						НС.МестоположениеКон = Ср.Value;	
					ИначеЕсли Ср.Ключ = "DWebastoON_dur" и Ср.Value <> "00:00:00" Тогда
						НС.РаботаВебасты = Дата("00010101"+СтрЗаменить(Ср.Value,":",""));//Дата(1,1,1) + Число(Ср.Value);
					ИначеЕсли Ср.Ключ = "DWebastoON_dist" Тогда
						НС.ПробегСВебастой = Ср.Value;
					ИначеЕсли Ср.Ключ = "DWebastoF_ON_time" Тогда
						Если ЗначениеЗаполнено(Ср.Value) Тогда
							ДатаСтр = СтрЗаменить(Ср.Value,":","");
							ДатаСтр = СтрЗаменить(ДатаСтр,"-","");
							ДатаСтр = СтрЗаменить(ДатаСтр,"T","");
							ДатаСтр = СтрЗаменить(ДатаСтр,".","");
							ДатаСтр = СтрЗаменить(ДатаСтр," ","");
							ДатаСтр = СтрЗаменить(ДатаСтр," ","");
							Дата = Дата(ДатаСтр);
						Иначе
						    Дата = Дата(1,1,1);
						КонецЕсли;	
						
						НС.ДатаВремяВклВебаста = Дата;//?(ЗначениеЗаполнено(Ср.Value),Дата(Ср.Value),Неопределено);
					ИначеЕсли Ср.Ключ = "DWebastoL_OFF_time" Тогда
						Если ЗначениеЗаполнено(Ср.Value) Тогда
							ДатаСтр = СтрЗаменить(Ср.Value,":","");
							ДатаСтр = СтрЗаменить(ДатаСтр,"-","");
							ДатаСтр = СтрЗаменить(ДатаСтр,"T","");
							ДатаСтр = СтрЗаменить(ДатаСтр,".","");
							ДатаСтр = СтрЗаменить(ДатаСтр," ","");
							ДатаСтр = СтрЗаменить(ДатаСтр," ","");
							Дата = Дата(ДатаСтр);
						Иначе
						    Дата = Дата(1,1,1);
						КонецЕсли;	
						
						НС.ДатаВремяВыклВебаста = Дата;//?(ЗначениеЗаполнено(Ср.Value),Дата(Ср.Value),Неопределено);
					ИначеЕсли Ср.Ключ = "DDryerF_ON_time" Тогда
						Если ЗначениеЗаполнено(Ср.Value) Тогда
							ДатаСтр = СтрЗаменить(Ср.Value,":","");
							ДатаСтр = СтрЗаменить(ДатаСтр,"-","");
							ДатаСтр = СтрЗаменить(ДатаСтр,"T","");
							ДатаСтр = СтрЗаменить(ДатаСтр,".","");
							ДатаСтр = СтрЗаменить(ДатаСтр," ","");
							ДатаСтр = СтрЗаменить(ДатаСтр," ","");
							Дата = Дата(ДатаСтр);
						Иначе
						    Дата = Дата(1,1,1);
						КонецЕсли;	
						
						НС.ДатаВремяВклФена = Дата;//?(ЗначениеЗаполнено(Ср.Value),Дата(Ср.Value),Неопределено);		
					ИначеЕсли Ср.Ключ = "DDryerL_OFF_time" Тогда
						Если ЗначениеЗаполнено(Ср.Value) Тогда
							ДатаСтр = СтрЗаменить(Ср.Value,":","");
							ДатаСтр = СтрЗаменить(ДатаСтр,"-","");
							ДатаСтр = СтрЗаменить(ДатаСтр,"T","");
							ДатаСтр = СтрЗаменить(ДатаСтр,".","");
							ДатаСтр = СтрЗаменить(ДатаСтр," ","");
							ДатаСтр = СтрЗаменить(ДатаСтр," ","");
							Дата = Дата(ДатаСтр);
						Иначе
						    Дата = Дата(1,1,1);
						КонецЕсли;	
						
						НС.ДатаВремяВыклФена = Дата;//?(ЗначениеЗаполнено(Ср.Value),Дата(Ср.Value),Неопределено);
					ИначеЕсли Ср.Ключ = "EngineMainMotohours" Тогда
						НС.МЧДвигателяШасси = Формат(Час(Дата("00010101"+СтрЗаменить(Ср.Value,":",""))),"ЧДЦ=1");////Формат(Число(Ср.Value)/3600,"ЧДЦ=1");	
					ИначеЕсли Ср.Ключ = "EngineMainMHOnParks" Тогда
						НС.МЧДвигателяНаОстановкахШасси = Формат(Час(Дата("00010101"+СтрЗаменить(Ср.Value,":",""))),"ЧДЦ=1");// Формат(Число(Ср.Value)/3600,"ЧДЦ=1");
					ИначеЕсли Ср.Ключ = "EngineMainMHInMove" Тогда
						НС.МЧДвигателяВДвиженииНаШасси = Формат(Час(Дата("00010101"+СтрЗаменить(Ср.Value,":",""))),"ЧДЦ=1");//Формат(Число(Ср.Value)/3600,"ЧДЦ=1");
					ИначеЕсли Ср.Ключ = "TankMainFuelLevel First" Тогда
						НС.КолВоТопливаНаНач = Ср.Value;	
					ИначеЕсли Ср.Ключ = "TankMainFuelLevel Last" Тогда
						НС.КолВоТопливаНаКон = Ср.Value;
					ИначеЕсли Ср.Ключ = "TankMainFuelUpVol Diff" Тогда
						НС.ОбъемВсехЗаправок = Ср.Value;						
						Заправки.Значение = Ср.Value;		
					ИначеЕсли Ср.Ключ = "TankMainFuelDnVol Diff" Тогда
						НС.ОбъемВсехСливов = Ср.Value;
						Сливы.Значение = Ср.Value;
					ИначеЕсли Ср.Ключ = "TankMainFuelUpCount" Тогда
						НС.КолВоВсехЗаправок = Ср.Value;
					ИначеЕсли Ср.Ключ = "TankMainFuelDnCount" Тогда
						НС.КолВоВсехСливов = Ср.Value;
					ИначеЕсли Ср.Ключ = "EngineMainFuelConsum" Тогда
						НС.ОбщийРасходТоплива = Ср.Value;
					ИначеЕсли Ср.Ключ = "EngineMainFuelConsumP" Тогда
						НС.ОбщийРасходНаОстановкахДвижении = Ср.Value;
					ИначеЕсли Ср.Ключ = "EngineMainFuelConsumPPerHour" Тогда
						НС.РасходНаОстановкахЗаЧас = Ср.Value;
					ИначеЕсли Ср.Ключ = "EngineMainFuelConsumPPerMH" Тогда
						НС.РасходНаОстановкахЗаМотоЧас = Ср.Value;
					ИначеЕсли Ср.Ключ = "EngineMainFuelConsumM" Тогда
						НС.РасходТопливаВДвижении = Ср.Value;
					ИначеЕсли Ср.Ключ = "EngineMainFuelConsumMPer100km" Тогда
						НС.РасходНа100км = Ср.Value;
					ИначеЕсли Ср.Ключ = "DKOMON_dur" Тогда
						НС.ВремяРаботыВО = Дата("00010101"+СтрЗаменить(Ср.Value,":",""));//Дата(1,1,1) + Число(Ср.Value);
					ИначеЕсли Ср.Ключ = "DREngineMainLs1000ON_dur" Тогда
						НС.ВремяРаботыДвигателяДо1000 = Дата("00010101"+СтрЗаменить(Ср.Value,":",""));//Дата(1,1,1) + Число(Ср.Value);
					ИначеЕсли Ср.Ключ = "DREngineMainLs1000ON_dist" Тогда
						НС.ПробегСОборотамиДо1000 = Ср.Value;
					ИначеЕсли Ср.Ключ = "DREngineMainGt1000Ls2000ON_dur" Тогда
						НС.ВремяРаботыДвигателяОт1000До2000 = Дата("00010101"+СтрЗаменить(Ср.Value,":",""));//Дата(1,1,1) + Число(Ср.Value);
					ИначеЕсли Ср.Ключ = "DREngineMainGt1000Ls2000ON_dist" Тогда
						НС.ПробегНаОборотахОт1000До2000 = Ср.Value;
					ИначеЕсли Ср.Ключ = "DREngineMainGt2000ON_dur" Тогда
						НС.ВремяРаботыДвигателяБолее2000 = Дата("00010101"+СтрЗаменить(Ср.Value,":",""));//Дата(1,1,1) + Число(Ср.Value);
					ИначеЕсли Ср.Ключ = "DREngineMainGt2000ON_dist" Тогда
						НС.ПробегНаОборотахБолее2000 = Ср.Value;
					ИначеЕсли Ср.Ключ = "DREngineVOLs1000ON_dur" Тогда
						НС.ВремяРаботыВОДо1000 = Дата("00010101"+СтрЗаменить(Ср.Value,":",""));//Дата(1,1,1) + Число(Ср.Value);
					ИначеЕсли Ср.Ключ = "DREngineVOLs1000ON_dist" Тогда
						НС.ПробегСОборотамиВОДо1000 = Ср.Value;
					ИначеЕсли Ср.Ключ = "DREngineVOGt1000Ls2000ON_dur" Тогда
						НС.ВремяРаботыВОот1000до2000 = Дата("00010101"+СтрЗаменить(Ср.Value,":",""));//Дата(1,1,1) + Число(Ср.Value);
					ИначеЕсли Ср.Ключ = "DREngineVOGt1000Ls2000ON_dist" Тогда
						НС.ПробегСОборотамиВОот1000до2000 = Ср.Value;
					ИначеЕсли Ср.Ключ = "DREngineVOGt2000ON_dur" Тогда
						НС.ВремяРаботыВОболее2000 = Дата("00010101"+СтрЗаменить(Ср.Value,":",""));//Дата(1,1,1) + Число(Ср.Value);
					ИначеЕсли Ср.Ключ = "DREngineVOGt2000ON_dist" Тогда
						НС.ПробегСОборотамиВОболее2000 = Ср.Value;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	НашТекущийИндекс = ДокументОбъект.Заправки.Количество()-1;
	
	Пока НашТекущийИндекс >= 0 Цикл
		Если ДокументОбъект.Заправки[НашТекущийИндекс].Значение = 0 Тогда
		     ДокументОбъект.Заправки.Удалить(НашТекущийИндекс);
		КонецЕсли;
		 
		НашТекущийИндекс = НашТекущийИндекс - 1;
	КонецЦикла;	
	
	НашТекущийИндекс = ДокументОбъект.Сливы.Количество()-1;
	
	Пока НашТекущийИндекс >= 0 Цикл
		Если ДокументОбъект.Сливы[НашТекущийИндекс].Значение = 0 Тогда
		     ДокументОбъект.Сливы.Удалить(НашТекущийИндекс);
		 КонецЕсли;
		 
		НашТекущийИндекс = НашТекущийИндекс - 1;
	КонецЦикла;	
	
	ДокументОбъект.Записать();
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция ПолучитьДанныеПоМашинам() Экспорт
	
	СписокМашин  = Новый ТаблицаЗначений;
	СписокМашин.Колонки.Добавить("НомерСтроки");
	СписокМашин.Колонки.Добавить("ID");
	СписокМашин.Колонки.Добавить("Группа");
	СписокМашин.Колонки.Добавить("СхемаNet");
	СписокМашин.Колонки.Добавить("СхемаID");
	СписокМашин.Колонки.Добавить("СерНомер");
	СписокМашин.Колонки.Добавить("Делитель");
	СписокМашин.Колонки.Добавить("Guid");
	СписокМашин.Колонки.Добавить("ГосНомер");

	Токен = "";
	ИдентификаторСхемы = "";
	АдресСервера = "https://glonass.mecamineft.com";
	ИмяФайлаОтвета = КаталогВременныхФайлов() + "Response.json";
	
	ПолучитьТокенНаСервере(Токен,ИдентификаторСхемы,АдресСервера,ИмяФайлаОтвета);	
		
	Если НЕ ЗначениеЗаполнено(Токен) Тогда
		Сообщить("Нет данных о токене для авторизации на сайте!");
		
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	СтрокаЗапроса = "/ServiceJSON/EnumSchemas";
	
	Заголовки = Новый Соответствие;
   	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("AG-TOKEN", Токен);
	
	Схемы = ОтправитьЗапросСервер(СтрокаЗапроса, Заголовки,ЛОЖЬ,ЛОЖЬ,АдресСервера,ИмяФайлаОтвета); 	

	для каждого СхемаНужнаяОрганизация из Схемы цикл
		Попытка
			Если СхемаНужнаяОрганизация.Name = "МеКаМинефть + Ситэк-Транс" Тогда
				СтрокаЗапроса = "/ServiceJSON/EnumDevices?schemaID=" + СхемаНужнаяОрганизация.ID;
		
				Заголовки = Новый Соответствие;
			   	Заголовки.Вставить("Content-Type", "application/json");
				Заголовки.Вставить("AG-TOKEN", Токен);

				Приборы = ОтправитьЗапросСервер(СтрокаЗапроса, Заголовки,ЛОЖЬ,ЛОЖЬ,АдресСервера,ИмяФайлаОтвета);	
				//ДеревоТС = РеквизитФормыВЗначение("ТабТС");
				Сообщение = Новый СообщениеПользователю;
				ИдентификаторыТС = "";
				МассивИдентификаторовТС = Новый Массив;

				Если Приборы = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				НомерС = 0;
				Сч = 1;
				
				Для каждого Сп Из Приборы.Items Цикл			// Приборы
					ДелительР = "";
					
					Если Сп.TripSplitters.Количество() > 0 Тогда
						Для каждого СДелит Из Сп.TripSplitters Цикл
							ДелительР = ДелительР + СДелит.Name + " - " + СДелит.ID + ",";
						КонецЦикла; 	
					КонецЕсли;
					
					НомерС = НомерС + 1;
					
					НС = СписокМашин.Добавить();
					НС.НомерСтроки  = НомерС;
					НС.Группа		= Сп.Name;
					НС.ID			= Сп.ID;
					НС.СхемаNet		= СхемаНужнаяОрганизация.Name;
					НС.СхемаID		= СхемаНужнаяОрганизация.ID;
					НС.СерНомер		= Число(Сп.Serial);
					НС.Делитель 	= ДелительР;
					ИдентификаторыТС = ?(ИдентификаторыТС = "", Сп.ID, ИдентификаторыТС + "," + Сп.ID);
					
					Если Сч = 30 Тогда
						МассивИдентификаторовТС.Добавить(ИдентификаторыТС);
						ИдентификаторыТС = "";
						Сч = 0;
					КонецЕсли;
					
					// Получим гос. номера ТС
					Для каждого Стр Из сп.Properties Цикл
						Если Стр.name = "VehicleRegNumber" Тогда
						    НС.ГосНомер = Стр.Value;
						КонецЕсли;
					КонецЦикла; 
					
					Сч = Сч + 1;
				КонецЦикла; 
			КонецЕсли;
		исключение
		конецПопытки
	конецЦикла;
	
	Возврат СписокМашин;
	
КонецФункции

Функция ПолучитьДанныеСПистолета(ТС, Дата) Экспорт
	Токен = "";
	ИдентификаторСхемы = "";
	АдресСервера = "http://glonass.mecamineft.com";
	ИмяФайлаОтвета = КаталогВременныхФайлов() + "Response.json";
	ПолучитьТокенНаСервере(Токен,ИдентификаторСхемы,АдресСервера,ИмяФайлаОтвета);
	
	Если НЕ ЗначениеЗаполнено(Токен) Тогда
		Сообщить("Нет данных о токене для авторизации на сайте!");
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	IDs = ПолучитьIDТранспорта(ТС);
	Если IDs = Неопределено Тогда
		Возврат 0;	
	КонецЕсли;
	IDТС = IDs[0];
	ИдентификаторСхемы = IDs[1];
	
	СтрокаЗапроса = 	
	"/ServiceJSON/GetStage?session=" + Токен +
	"&schemaID=" + ИдентификаторСхемы +
	"&IDs=" + IDТС +
	"&SD=" + Формат(НачалоДня(Дата), "ДФ=yyyyMMdd-HHmm") +
	"&ED=" + Формат(КонецДня(Дата), "ДФ=yyyyMMdd-HHmm") +
	"&stageName=TAGFC" +
	"&tripParams=TAGFCFuelUpDnVol%2CID2%20First";
	
	Заголовки = Новый Соответствие;
   	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("AG-TOKEN", Токен);
	
	Схемы = ОтправитьЗапросСервер(СтрокаЗапроса, Заголовки,ЛОЖЬ,ИСТИНА,АдресСервера,ИмяФайлаОтвета);
	
	Возврат Схемы;
КонецФункции

Функция ПолучитьIDДляЗаправки() Экспорт
	Токен = "";
	ИдентификаторСхемы = "";
	АдресСервера = "http://glonass.mecamineft.com";
	ИмяФайлаОтвета = КаталогВременныхФайлов() + "Response.json";
	ПолучитьТокенНаСервере(Токен,ИдентификаторСхемы,АдресСервера,ИмяФайлаОтвета);
	
	Если НЕ ЗначениеЗаполнено(Токен) Тогда
		Сообщить("Нет данных о токене для авторизации на сайте!");
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	СтрокаЗапроса = 	
	"/ServiceJSON/EnumDrivers?session=" + Токен +
	"&schemaID=08ae4c45-2d2d-4946-996b-ee22e72952db";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("AG-TOKEN", Токен);
	
	Схемы = ОтправитьЗапросСервер(СтрокаЗапроса, Заголовки,ЛОЖЬ,ИСТИНА,АдресСервера,ИмяФайлаОтвета);
	
	Возврат Схемы;		
КонецФункции

Функция ПолучитьОбъемПоступленияТоплива(IdТерминала, ИдентификаторСхемы, Дата) Экспорт
	
	Токен = "";
	IdСхемы = "";
	АдресСервера = "http://glonass.mecamineft.com";
	ИмяФайлаОтвета = КаталогВременныхФайлов() + "Response.json";
	ПолучитьТокенНаСервере(Токен,IdСхемы,АдресСервера,ИмяФайлаОтвета);
	
	Если НЕ ЗначениеЗаполнено(Токен) Тогда
		Сообщить("Нет данных о токене для авторизации на сайте!");
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	СтрокаЗапроса = 	
	"/ServiceJSON/GetStage?session=" + Токен +
	"&schemaID=" + ИдентификаторСхемы +
	"&IDs=" + IdТерминала +
	"&SD=" + Формат(НачалоДня(Дата), "ДФ=yyyyMMdd-HHmm") +
	"&ED=" + Формат(КонецДня(Дата), "ДФ=yyyyMMdd-HHmm") +
	"&stageName=TankMain" +
	"&tripParams=TankMainFuelUpDnVol";
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("AG-TOKEN", Токен);
	
	Схемы = ОтправитьЗапросСервер(СтрокаЗапроса, Заголовки,ЛОЖЬ,ИСТИНА,АдресСервера,ИмяФайлаОтвета);
	Сумма = 0;	
	Для Каждого Заправка Из Схемы Цикл
		Если Заправка.Значение <> Неопределено Тогда
			ПараметрыТаблицы = Заправка.Значение["Params"];
			ИндексОбъемПоБаку = ПараметрыТаблицы.Найти("TankMainFuelUpDnVol");
			Для Каждого Заправка Из Заправка.Значение["Items"] Цикл
				Сумма = Сумма + Заправка["Values"][ИндексОбъемПоБаку];
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если Сумма < 0 Тогда
		Сумма = 0;
	КонецЕсли;
	Возврат Сумма;
	
КонецФункции

Функция ПолучитьIDТерминалаТС(ТС) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	GDS_ДанныеИзАвтографаПоТС.ID_ТС КАК ID_Терминала,
	|	GDS_ДанныеИзАвтографаПоТС.ID_Схема КАК ID_Схема
	|ИЗ
	|	РегистрСведений.GDS_ДанныеИзАвтографаПоТС КАК GDS_ДанныеИзАвтографаПоТС
	|ГДЕ
	|	GDS_ДанныеИзАвтографаПоТС.ТранспортноеСредство = &ТранспортноеСредство";
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТС);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Массив = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Массив.Добавить(ВыборкаДетальныеЗаписи.ID_Терминала);
		Массив.Добавить(ВыборкаДетальныеЗаписи.ID_Схема);
	КонецЦикла;
	
	Возврат Массив;
КонецФункции

Функция ПолучитьЗаправкуДляТС(ТаблицаЗаправок, ТС, ТаблицаID) Экспорт
	
	ID = ПолучитьIDТС(ТС.ГосударственныйНомер, ТаблицаID);
	Если ID.Количество() = 2 Тогда
		ID1 = ID[0];
		ID2 = ID[1];
	ИначеЕсли ID.Количество() = 1 Тогда
		ID1 = ID[0];
		ID2 = "0";
	КонецЕсли;
	Для Каждого АЗС Из ТаблицаЗаправок Цикл
		Если АЗС.Значение <> Неопределено Тогда
			ПараметрыТаблицы = АЗС.Значение["Params"];
			ИндексОбъемПоПистолету = ПараметрыТаблицы.Найти("TAGFCFuelUpDnVol");
			ИндексIDВодителя = ПараметрыТаблицы.Найти("ID2 First");
			Для Каждого Заправка Из АЗС.Значение["Items"] Цикл
				IDЗаправляемого = Заправка["Values"][ИндексIDВодителя];
				Если IDЗаправляемого = ID1 ИЛИ IDЗаправляемого = ID2 Тогда
					Возврат Заправка["Values"][ИндексОбъемПоПистолету];
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецФункции

Функция ПоискМашиныПоГосНомеру(ГосНомер,Запрос)
	
	ТС = Справочники.уатТС.ПустаяСсылка();
	
	Запрос.УстановитьПараметр("ГосударственныйНомер",ГосНомер);
					
	Результат = Запрос.Выполнить().Выбрать();
					
	Пока Результат.Следующий() Цикл
		ТС = Результат.Ссылка;	
	КонецЦикла;	
	
	Возврат ТС;
	
КонецФункции  

Процедура ПолучитьТокенНаСервере(Токен,ИдентификаторСхемы,АдресСервера,ИмяФайлаОтвета)
	
	Токен = "";
	ИдентификаторСхемы = "";
	
	СмещениеВремени = Цел((ТекущаяДата() - УниверсальноеВремя(ТекущаяДата()))/60);
	
	СтрокаЗапроса = "/ServiceJSON/Login?UserName=" + "User_1C" + "&Password=" + "Lgdeu7916" + "&UTCOffset=" + СмещениеВремени;
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	ОтветСтрока = ОтправитьЗапросСервер(СтрокаЗапроса, Заголовки, Истина,ЛОЖЬ,АдресСервера,ИмяФайлаОтвета);
	
	Если ТипЗнч(ОтветСтрока) = Тип("Строка") Тогда
		Токен = ОтветСтрока;	
	КонецЕсли;
	
КонецПроцедуры

Функция ОтправитьЗапросСервер(ТекстЗапроса, Заголовки, ЗапросТокена = Ложь, ПрочитатьВСоответствие = Ложь,АдресСервера,ИмяФайлаОтвета)

	Попытка
		Соединение  =  ПолучитьHTTPСоединениеСПрокси(АдресСервера);
		
		ЗапросHttp = Новый HTTPЗапрос(ТекстЗапроса, Заголовки);
		ОтветHttp = Соединение.Получить(ЗапросHttp);
	Исключение
		Сообщить("Ошибка соединения с сервером: " + ОписаниеОшибки());
	КонецПопытки; 	
	
	Если ОтветHttp <> Неопределено И ПроверитьОтветЗапроса(ОтветHttp) Тогда
		Если ЗапросТокена Тогда
			Возврат  ОтветHttp.ПолучитьТелоКакСтроку();
		КонецЕсли;
		
		ОтветHttp.ПолучитьТелоКакДвоичныеДанные().Записать(ИмяФайлаОтвета);
		
		Возврат РазобратьОтвет(ИмяФайлаОтвета, ПрочитатьВСоответствие);
	Иначе
		Возврат Неопределено;
	КонецЕсли; 	

КонецФункции 

Функция ПолучитьHTTPСоединениеСПрокси(АдресСервера)

	СтруктураURI = СтруктураURI(АдресСервера); 
	HTTPСоединение = Новый HTTPСоединение(СтруктураURI.Хост, СтруктураURI.Порт,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
	
	Возврат HTTPСоединение;
	
КонецФункции 

Функция ПроверитьОтветЗапроса(ОтветHttp)
	Перем Результат;
	
	// Статусы 1XX и 2XX считаем хорошими
	Результат = Истина;
	Сообщение = Новый СообщениеПользователю;
	
	// Ошибки 4XX говорят о неправильном запросе - в широком смысле
	// Может быть неправильный адрес, ошибка аутентификации, плохой формат запроса
	// Подробнее смотри http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.4
	Если ОтветHttp.КодСостояния >= 400 и ОтветHttp.КодСостояния < 500  Тогда
		Сообщение.Текст = "Код статуса больше 4XX, ошибка запроса.  Код статуса: " + ОтветHttp.КодСостояния + 
		Символы.ПС + "Подробнее смотри http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.4";
		Сообщение.Сообщить();
		Результат = Ложь;
	КонецЕсли;
	
	// Ошибки 5XX говорят о проблемах на сервере (возможно, прокси-сервер)
	// Это может быть программная ошибка, нехватка памяти, ошибка конфигурации и т.д.
	// Подробнее смотри http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.5
	Если ОтветHttp.КодСостояния >= 500 и ОтветHttp.КодСостояния < 600  Тогда
		Сообщение.Текст = "Код статуса больше 5XX, ошибка сервера. Код статуса: " + ОтветHttp.КодСостояния +
		Символы.ПС + "Подробнее смотри http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.5";
		Сообщение.Сообщить();
		Результат = Ложь;
	КонецЕсли;
	
	// Обрабатываем перенаправление
	Если ОтветHttp.КодСостояния >= 300 и ОтветHttp.КодСостояния < 400  Тогда
		Результат = Ложь;
		Сообщение.Текст = "Код статуса больше 3XX, Перенаправление. Код статуса: " + ОтветHttp.КодСостояния;
		Сообщение.Сообщить();
		Если ОтветHttp.КодСостояния = 302 Тогда
			Сообщение.Текст = "Код статуса 302, Постоянное перенаправление.";
			Сообщение.Сообщить();
			АдресРесурса = ОтветHttp.Заголовки.Получить("Location");
			Если АдресРесурса <> Неопределено Тогда
				Сообщение.Текст = "Возможно правильнее выполнить запрос по адресу " + АдресРесурса;
			Иначе
				Сообщение.Текст = "Сервер не сообщил адрес ресурса!";
			КонецЕсли;
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
	Если ОтветHttp.КодСостояния < 300 Тогда 
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция РазобратьОтвет(ИмяФайлаОтвета, ПрочитатьВСоответствие)
	
	Перем ИмяJSON, ЗнJSON, ОтветJSON;
	
	ФайлНаДиске = Новый Файл(ИмяФайлаОтвета);
	Если НЕ ФайлНаДиске.Существует() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Сообщение	= Новый СообщениеПользователю;
	ЧтениеJSON	= Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(ИмяФайлаОтвета);
	ОтветJSON	= ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
	ЧтениеJSON.Закрыть();	
	Возврат ОтветJSON;
	
КонецФункции

Функция СтруктураURI(Знач СтрокаURI) Экспорт
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = Найти(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;

	// строка соединения и путь на сервере
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = Найти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
		
	// информация пользователя и имя сервера
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = Найти(СтрокаСоединения, "@");
	Если Позиция > 0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;
	
	// логин и пароль
	Логин = СтрокаАвторизации;
	Пароль = "";
	Позиция = Найти(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = Найти(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(Порт <> "", Число(Порт), Неопределено));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции

Функция ВернутьДокументДляЗаполнения(Запрос,ДатаЗапроса)
	
	Запрос.УстановитьПараметр("ДатаЗапроса",ДатаЗапроса);
	Результат = Запрос.Выполнить().Выбрать();
	
	ДокументАвт = Неопределено;
	
	Пока Результат.Следующий() Цикл
		ДокументАвт = Результат.Ссылка; 	
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ДокументАвт) Тогда
		ДокументАвт = Документы.GDS_ДанныеИзАвтограф.СоздатьДокумент();
		ДокументАвт.Дата = ДатаЗапроса;
		ДокументАвт.Записать();
	Иначе
		ДокументАвт	= ДокументАвт.ПолучитьОбъект();
		ДокументАвт.Записать();
	КонецЕсли;	
	
	Возврат ДокументАвт;
	
конецФункции

Функция ПреобразоватьДатуВСтроку(Знач ДатаUTC)
	
	СтрокаДаты = Формат(ДатаUTC, "ДФ=""ггггММдд'-'ЧЧммсс""");
	
	Возврат СтрокаДаты;

КонецФункции

Функция ПолучитьIDТранспорта(ТС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДляЧтенияИнформацииИзАвтографа.ID_Автограф КАК ID,
	|	ДанныеДляЧтенияИнформацииИзАвтографа.ID_схема КАК ID_схема
	|ИЗ
	|	РегистрСведений.GDS_ДанныеДляЧтенияИнформацииИзАвтографа.СрезПоследних КАК ДанныеДляЧтенияИнформацииИзАвтографа
	|ГДЕ
	|	ДанныеДляЧтенияИнформацииИзАвтографа.ТС.ГосударственныйНомер = &ТС";
	Запрос.УстановитьПараметр("ТС", ТС.Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Массив = Новый Массив;
	Если Выборка.Следующий() Тогда
		Массив.Добавить(Выборка.ID);
		Массив.Добавить(Выборка.ID_схема);
		Возврат Массив;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьIDТС(ТС, ТаблицаID)
	Массив = Новый Массив();
	Для Каждого Строка Из ТаблицаID["Items"] Цикл
		Если Строка["Name"] = ТС Тогда
			Массив.Добавить(Строка["ID"]);
			Если Массив.Количество() = 2 Тогда
				Возврат Массив;		
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Массив
КонецФункции
